# Alternate yaml for GELAN-ViT

# parameters
nc: 80  # number of classes
depth_multiple: 0.5  # model depth multiple
width_multiple: 0.5  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [16, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [64, 32, 16, 1]],  # 2

   # avg-conv down
   [-1, 1, ADown, [64]],  # 3-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 4

   # avg-conv down
   [-1, 1, ADown, [128]],  # 5-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 6

   # avg-conv down
   [-1, 1, ADown, [128]],  # 7-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 8

   # vit block
   [8, 1, ViT, [64]],  # 9
  ]

# gelan head
head:
  [
   # elan-spp block
   [8, 1, SPPELAN, [128, 64]],  # 10

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 13

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 1]],  # 16 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [64]],
   [[-1, 13], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 19 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [128]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 22 (P5/32-large)

   # detect
   [[ 9, 16, 19, 22], 1, DDetect, [nc]],
  ]